package ch01_variable;

// 변수 - 03
// 변수 명명 규칙
public class Var04 {
    public static void main(String[] args) {
        // 자바 언어 규칙
        /*
        1. 클래스는 대문자로 시작한다.
        2. 클래스를 제외한 나머지는 소문자로 시작 + camelCase를 사용한다
        - 변수
        3. 예외 : 상수, 패키지 등
        - 상수 : 대문자와 언더바(_)만 사용
        - 패키지 : 모두 소문자 사용
        */

        // 자바 변수명 규칙
        /*
        1. 변수의 이름은 영문자, 숫자, 언더바(_), 달러($)로 구성된다.
        2. 변수명은 숫자로 시작할 수 없다.
        3. 변수명에 사용되는 대소문자는 구분되며, 길이 제한이 없다.
        4. 예약어(Reserved Words)를 변수명으로 사용할 수 없다.
        5. 여러 단어로 변수를 이룰 경우, camelCase로 표기한다.
        6. 상수의 이름은 대문자와 언더바(_)로만 구성한다.
        7. 변수 이름은 용도를 명확하게 설명할 수 있도록 짓는다.
        */

    }
}
